Repository: aphilat1980/ios-homeworks
Catalog: Navigation/*.lproj/Localizable.strings
Languages: ru

# feedViewControllerTitleButton1
source: Go to post - button 1
ru: Перейти на пост - кнопка 1

# feedViewControllerTitleButton2
source: Go to post - button 2
ru: Перейти на пост - кнопка 2

# feedViewControllerTextFieldPlaceholder
source: Enter a key word
ru: Введите ключевое слово...

# feedViewControllerCheckButtonTitle
source: Check
ru: Проверить

# feedViewControllerEmptyFieldAlertTitle
source: Error!!
ru: Ошибка!!

# feedViewControllerEmptyFieldAlertMessage
source: Empty value entered!
ru: Введено пустое значение!

# feedViewControllerEmptyFieldAlertButtonTitle
source: Back...
ru: Вернуться

# savedPostsTabBarTitle
source: Saved Posts
ru: Сохр.посты

# feedTabBarTitle
source: Feed
ru: Лента

# profileTabBarTitle
source: Profile
ru: Профиль

# postViewControllerTitle
source: My Post
ru: Мой пост

# postViewControllerRightNavButtonTitle
source: Info
ru: Инфо

# infoViewControllerButtonTitle
source: Get Alert
ru: Вызвать алерт

# infoViewControllerPlanetText
source: The orbital period of the planet Tatooine is
ru: Период обращения планеты Татуин равен

# infoViewControllerAlertTitle
source: Alert
ru: Алерт

# infoViewControllerAlertMessage
source: Attention! Attention!
ru: Внимание Внимание!!

# infoViewControllerAlertAction1Title
source: Message 1
ru: Сообщение 1

# infoViewControllerAlertAction1ResultText
source: You've tapped button Message 1
ru: Вы нажали кнопку Сообщение 1

# infoViewControllerAlertAction2Title
source: Message 2
ru: Сообщение 2

# infoViewControllerAlertAction2ResultText
source: You've tapped button Message 2
ru: Вы нажали кнопку Сообщение 2

# loginViewControllerPlaceholder1
source: Emal or Phone
ru: Эл почта или телефон

# loginViewControllerPlaceholder2
source: Password
ru: Пароль

# loginViewControllerButtonTitle
source: Log In
ru: Войти

# loginViewControllerNoUserAlertTitle
source: Login Error
ru: Ошибка входа

# loginViewControllerNoUserAlertMessage
source: User registration required
ru: Необходимо зарегистрировать пользователя

# loginViewControllerNoUserAlertAction1Title
source: Register new user
ru: Зарегистрировать нового пользователя

# loginViewControllerRegisterFailureAlertTitle
source: Login Error. User did not register
ru: Ошибка входа. Пользователь не зарегистрирован

# loginViewControllerRegisterFailureActionTitle
source: Back
ru: Вернуться

# loginViewControllerNoUserAlertAction2Title
source: Back
ru: Вернуться

# loginViewControllerFailureAlertTitle
source: Login Error
ru: Ошибка входа

# loginViewControllerFailureActionTitle
source: Back
ru: Вернуться

# loginViewControllerLoginSuccessUserName
source: Alexander
ru: Александр

# loginViewControllerLoginSuccessUserStatus
source: Hello!
ru: Привет!

# profileTableViewCellButtonTitile
source: Show status
ru: Показать статус

# profileTableViewCellStatusLabelText
source: Waiting for something...
ru: Ожидаем...

# profileViewControllerSuccessSavedAlertTitle
source: Post Saved Success
ru: Пост успешно сохранен

# profileViewControllerSuccessSavedAlertMessage
source: Check Saved Posts
ru: Проверь сохраненные посты

# profileViewControllerFailureSavedAlertTitle
source: Post Saved Error
ru: Ошибка сохранения поста

# profileViewControllerFailureSavedAlertMessage
source: You Have Saved This Post Already
ru: Этот пост уже сохранен

# photosTableViewCellTitleLabel
source: Photos
ru: Фото

# photosViewControllerTitle
source: Photo Galery
ru: Фото галерея

# postTableViewCellLikesText
source: Likes:
ru: Лайки:

# postTableViewCellViewsText
source: Views:
ru: Просмотры:

# savedPostViewControllerLikesText
source: Likes:
ru: Лайки:

# savedPostViewControllerViewsText
source: Views:
ru: Просмотры:

# savedPostViewControllerResetButton
source: Reset
ru: Сбросить

# savedPostViewControllerSearchButton
source: Search
ru: Поиск

# savedPostViewControllerAlertTitle
source: Enter User Name
ru: Введите имя автора

# savedPostViewControllerAlertActionTitle
source: Search
ru: Применить

# savedPostViewControllerDeleteButtonTitle
source: Delete
ru: Удалить

# author1
source: Ivanov Ivan
ru: Иванов Иван

# author2
source: Petrov Petr
ru: Петров Петр

# author3
source: Sidorov Oleg
ru: Сидоров Олег

# author4
source: Bogdanov Bogdan
ru: Богданов Богдан

# description1
source: A lot of controversy is also caused by the history of the origin of cats, which is also very ambiguous. The most common opinion, which, by the way, especially took root in Russia, is that the only ancestor of modern cats is the Western Asian North African steppe cat, which was not domesticated at all in Egypt, and in Nubia, and this happened about 4 thousand years ago. Only after that, cats came to Egypt, and then appeared in Asia, where they successfully interbred with forest Bengal species
ru: Много споров вызывает также история происхождения кошек, которая тоже весьма неоднозначна. Самое распространенное мнение, которое, кстати, особенно прижилось в России, заключается в том, что единым предком современных кошек является переднеазиатская североафриканская степная кошка, которая была одомашнена вовсе не в Египте, а в Нубии, и произошло это около 4 тысяч лет назад. Только после этого кошки попали в Египет, а затем появились и в Азии, где успешно скрестились с лесными бенгальскими видами

# description2
source: Alien, alien (from other planets, from outer space), alien (English alien, “alien”) - a hypothetical intelligent being of extraterrestrial origin, a character of popular culture, including works of art, ufology, conspiracy theories; (particularly about the alien invasion) and some new religious movements
ru: Инопланетя́нин, пришелец (с других планет, из космоса), чужой (англ. alien, «чужой») — гипотетическое разумное существо внеземного происхождения, персонаж массовой культуры, в том числе художественных произведений, уфологии, конспирологии; (в частности, о вторжении инопланетян) и некоторых новых религиозных движений

# description3
source: Cocktail - "Burning lambrghini ": Pour into a cocktail glass first coffee liqueur, then sambuca so that it lies on the top layer. Pour Irish Cream into one glass and Blue Curacao into the other. We set fire to the sambuca, then pour the contents of two glasses at once into a cocktail glass while the guest drinks.
ru: Коктейль - "Горящая ламбрджини": Наливаем в коктейльную рюмку сначала кофейный ликёр, затем самбуку так, чтобы она легла верхним слоем. В одну рюмку наливаем Айриш крим, в другую — Блю Кюрасао. Поджигаем самбуку, затем вливаем в коктейльную рюмку сразу содержимое двух рюмок, пока гость пьёт.

# description4
source: Skeleton - a set of bones of the human body, a passive part of the musculoskeletal system. It serves as a support for soft tissues, a point of attachment for muscles, a receptacle and protection for internal organs. The bone tissue of the skeleton develops from the mesenchyme.
ru: Скелет - совокупность костей человеческого организма, пассивная часть опорно-двигательного аппарата. Служит опорой мягким тканям, точкой приложения мышц, вместилищем и защитой внутренних органов. Костная ткань скелета развивается из мезенхимы.
